[
  {
    "id": 1,
    "title" : "Đồng hành cùng Point Avenue với dịch vụ: Tư vấn du học",
    "name": "Nhi D.",
    "school": "Pomona College",
    "info": [
      "Em sẽ không bao giờ quên được khi chỉ còn hai ba ngày trước hạn nộp ED, em oà khóc trước mặt thầy John bởi vì bài luận cá nhân của em vẫn chưa hoàn thiện và em cảm thấy em không thể viết được nữa. Thật xấu hổ quá đi mà!! Và thầy John đã bình tĩnh an ủi em, nói rằng việc này là hoàn toàn bình thường. Em cảm thấy lúc đó như là có một người anh trai đang quan tâm tới em. Em chân thành cảm ơn thầy vì em không ngờ rằng những lúc bản thân không mạnh mẽ được thầy đón nhận như vậy. Em cảm thấy rằng các cố vấn Point Avenue không chỉ là những người thầy chỉ bảo, dạy dỗ em. Tất cả mọi người em gặp tại PA trước và sau mùa nộp hồ sơ đều thực sự tốt bụng, thấu đáo và luôn động viên học sinh chúng em. PA giống như một gia đình của em vậy. Mọi người đã giúp đỡ em rất nhiều để trở nên tự tin đối đấu với rất nhiều thử thách trong quá trình nộp hồ sơ đại học và trong cuộc sống."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/NhiD.jpg"
  },
  {
    "id": 2,
    "title" : "Đồng hành cùng Point Avenue với dịch vụ: Tư vấn du học",
    "name": "Thu Yen",
    "school": "Bryn Mawr College",
    "info": [
      "Em không biết phải bắt đầu chia sẻ về trải nghiệm với Point Avenue như thế nào với tâm trạng đầy nước mắt, bởi vì đó là cảm xúc của em khi bắt đầu quá trình nộp hồ sơ. Trong góc văn phòng nhỏ, em cảm thấy sợ hãi về một tương lai mờ mịt với quá nhiều việc cần phải làm và chuẩn bị. Tuy nhiên, em đã tự tin hơn bởi vì em biết rằng PA thật sự khác biệt và các cố vấn đều có niềm tin vào năng lực của em. Để nói về PA em có thể dành ra cả giờ cả ngày để chia sẻ!</br>Mỗi lần em tới văn phòng, em luôn cảm thấy được chào đón. Mọi người đều ở đó kể cả khi em làm việc một mình, chỉ đơn giản là động viên em và giúp em tự tin vào bản thân mình hơn. Mặc dù các cố vấn đều rất bận rộn, các thầy cô luôn tươi cười, luôn dành thời gian để rèn luyện sức khoẻ trong phòng gym - là một nguồn động lực và động viên lớn đối với em. Việc khám phá một lĩnh vực mới với sự dũng cảm và ý chí đón nhận thất bại trở nên dễ dàng với em hơn rất nhiều bởi vì em biết rằng các thầy cô sẽ luôn ở bên cạnh em để dìu dắt em, hướng dẫn em vượt qua những thất bại này. Từ việc quan sát các giáo viên làm việc và tương tác với phụ huynh và học sinh, em hiểu được cách các thầy cô áp dụng Character First trong giáo dục: bằng cách tự tiếp nhận và cảm nhận điều đó. PA là nơi mà em học được cách tiếp nhận những điều khác biệt và tôn trọng lựa chọn của cá nhân. Khi nhìn nhận một vấn đề, khác với đa số nhìn nhận và đánh giá ở trên bề nổi, cố vấn PA đã chỉ cho em việc đánh giá vấn đề đa chiều, và em nghĩ rằng em đã trở thành một con người chấp nhận và yêu thương bản thân mình, và với cả những người khác."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/ThuYen.jpg"
  },
  {
    "id": 3,
    "title" : "Đồng hành cùng Point Avenue với dịch vụ: Tư vấn du học",
    "name": "Eileen",
    "school": "UCLA",
    "info": [
      "Ban đầu, em đã tự mình lên ý tưởng, và viết tất cả các bài luận để nộp cho các trường hạn nộp hồ sơ sớm ED. Thử thách lớn nhất của em là thể hiện được hết bản thân mình qua bài luận hay không. Trong quá trình chỉnh sửa bài luận, em đã tham khảo ý kiến của một vài người. Tuy nhiên, em vẫn thấy mơ hồ trong việc phát triển ý tưởng vì có quá nhiều ý kiến khác nhau và họ thực sự cũng không biết rõ về quá trình nộp hồ sơ đại học ở Mỹ, nên em nhận ra mình đã lãng phí thời gian của mình.</br>Các cố vấn tại Point Avenue đã đóng vai trò rất quan trọng trong quá trình nộp hồ sơ đại học của em. Khi em lên ý tưởng một mình, em đã phải mất rất nhiều thời gian suy nghĩ xem liệu đây có phải chủ đề hay để viết hay không. Các cố vấn tại Point Avenue đã hướng dẫn, cùng em phân tích các ý tưởng và gợi ý cho em cách để cá nhân hoá bài luận và truyền tải thông điệp vừa súc tích vừa thú vị. Nhờ vậy, em đã có thể viết được các bài luận thể hiện được hết bản thân mình. Em không những chỉ hài lòng với kết quả đại học của mình, mà còn cả với những bài luận nữa. Nếu không có Point Avenue, có lẽ em sẽ không thể kết thúc hành trình nộp đơn vào đại học của mình một cách thành công."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Eileen.jpg"
  },
  {
    "id": 4,
    "title" : "Đồng hành cùng Point Avenue với dịch vụ: Luyện thi chuẩn hoá, Tư vấn du học",
    "name": "Duc Minh",
    "school": "Union College",
    "info": [
      "Tất cả cố vấn ở Point Avenue đều rất tận tình giúp đỡ em. Khi em đưa ra một câu hỏi, dù câu hỏi đó có ngốc nghếch đến mức nào, các thầy cô đều sẵn sàng giải đáp. Trong quá trình hoàn thiện hồ sơ, em đã mắc lỗi rất nhiều, tuy nhiên vẫn được sự hỗ trợ nhiệt tình từ các thầy cô, và điều này đã tạo động lực cho em để nỗ lực hơn cũng như là để ý chi tiết hơn vào công việc mình làm. Thầy Erick đã hướng dẫn em cách để sắp xếp công việc và thời gian hiệu quả hơn: qua việc sử dụng Planner. Nói chung, hiệu suất và trách nhiệm với công việc của em đã cải thiện hơn rất nhiều từ khi làm việc với PA, bởi vì mọi người ở đây làm việc cực kỳ hiệu quả và dạy em rất nhiều về kỹ năng quản lý thời gian. Và em cũng nhận ra con người mình thay đổi về mặt chú trọng từng tiểu tiết trong những thành phẩm của mình, bởi vì em hiểu được rằng từng chi tiết sẽ giúp em trở thành một ứng viên nổi bật, và em sẽ không ngừng hoàn thiện cho tới khi em thực sự hài lòng với thành phẩm của mình.</br>Bên cạnh đó, tất cả các đầu công việc đều được đảm bảo hoàn thành một cách chuyên nghiệp. Tất cả mọi người nắm rõ quy trình và thủ tục, vì thế phụ huynh và học sinh được nhận những lời tư vấn phù hợp để đưa ra quyết định tốt nhất. Lúc đó em đã định từ chối trường ED của em và tiếp tục nộp hồ sơ cho các trường vòng RD. Em cảm thấy may mắn vì được thầy Erick và Tommy tư vấn và khuyên nên dừng lại, nếu không có lẽ em sẽ đi học ở ngôi trường không phù hợp với em với học phí cao hơn rất nhiều.</br>Một trong những điều quý giá nhất đối với em trong trải nghiệm cùng Point Avenue đó chính là sự hỗ trợ về mặt tinh thần. Các cố vấn thúc đẩy, thử thách em để nhìn nhận vào giá trị của bản thân mình, và nhận ra những điểm tốt đẹp trước khi bản thân em khám phá ra."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/DucMinh.jpg"
  },
  {
    "id": 5,
    "title" : "Đồng hành cùng Point Avenue với dịch vụ: Tư vấn du học",
    "name": "My Le",
    "school": "NYU, Tisch School of the Arts",
    "info": [
      "Khi em quyết định nộp hồ sơ đi du học Mỹ, em không có ý định tìm kiếm sự giúp đỡ từ phía bên ngoài bởi vì em không tìm thấy một trung tâm tư vấn nào phù hợp với bản thân và đáp ứng được nhu cầu của em. Lúc mà em đang 'bế tắc' với bài luận cá nhân, em đã có cơ hội tham gia một buổi workshop của PA. Các giáo viên đều kiên nhẫn trong việc hướng dẫn em viết, cũng như đưa ra định hướng để tạo ra sản phẩm hoàn thiện. Các thầy cô đã đưa ra vô vàn câu hỏi để em có thể động não, phát triển ý tưởng và cho em cơ hội để xác định được con người của mình. Các cố vấn không chỉ giúp em về mặt hoàn thiện bài luận và hồ sơ, họ thực sự giúp học sinh chúng em vươn cao vươn xa hơn, nuôi dưỡng ấp ủ những giấc mơ to lớn hơn, và hoàn thiện bản thân mỗi ngày. Nhìn lại chặng đường cùng với Point Avenue, việc quyết định tham gia buổi workshop về bài luận cá nhân cũng như là làm việc, trở thành thành viên của gia đình Point Avenue là một trong những quyết định tuyệt vời nhất trong năm cuối của em."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/MyLe.jpg"
  },
  {
    "id": 6,
    "title" : "Journey at PA: Admissions Consulting",
    "name": "Steven",
    "school": "NYU, Stern School of Business",
    "info": [
      "Initially, it was hard for me to believe someone could ever save my applications. There was only one and a half months left for me to apply to all of my 20+ colleges around the world, and I had underestimated the insane amount of work and research needed to finish the applications. It felt like mission impossible, but my mentor really made it happen with his patience, work ethic, and well-managed time schedule.<br><br>Finally, I was accepted into my Early Decision school, as well as most of the schools I applied to during the Early Round. My mentor was not only a good writing coach, but also an amazing listener. I was astonished by how all his advice and guidance, based on my many essay drafts, were able to connect all my ideas, life events, thoughts, and beliefs and weave them into one narrative so fluidly. It brought order and clarity to what felt like pure chaos.<br><br>Admittedly, I also developed a clearer understanding of myself throughout my time working with him. My growth and his trait of being a good listener, made a real and significant change to my whole application as he helped me figure out how to showcase my best authentic self. Working with him really made me feel all my efforts led to a perfect and positive result. I hope there will be future opportunities to work with PA again because they not only helped me complete everything with the highest quality possible, but also learn about myself throughout the process. I would recommend PA to anyone."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Steven.jpg"
  },
  {
    "id": 7,
    "title" : "Journey at PA: Admissions Consulting",
    "name": "XK",
    "school": "Princeton",
    "info": [
      "Before I came to Point Avenue, I had only one draft written 10 days before the submission deadline and absolutely no idea what I was doing. It was only thanks to Jason’s and Tommy’s encyclopaedic understanding of the US admissions system and indefatigable support and guidance that I was able to complete my applications at all, let alone obtain an offer from the school of my dreams. They were not only staggeringly competent, but also dedicated, understanding, and a genuine pleasure to work with.<br/>In late December, I was struggling to balance my college applications with a full-day training camp I had to attend. Tommy and Jason were willing to work around my hair-tearingly frustrating schedule. They understood my predicament, stayed up late well past midnight to help me with my essays, and moved forward even when training meant I was vanishing for hours at a time. They did not make any effort to “teach” me or force me to write as someone I was not, but rather listened patiently to what ideas I had and guided my thinking to tease out the best possible version of myself. Tommy and Jason are two of the most dedicated, competent, and passionate educators I’ve had the honour of learning from, and I would definitely encourage anyone else in need of help to seek guidance from them as well."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Debate Stock.jpg"
  },
  {
    "id":8,
    "title" : "Journey at PA: Test Prep, Admissions Consulting",
    "name": "John",
    "school": "UC Berkeley",
    "info": [
      "PAAC comes across as really friendly, and they offer help as friends and mentors, not teachers. Not only do they have the know-hows of college admissions, they genuinely cared. My consultant was always patient even when my essay writing was on halt for quite a while, and understood my situation. Also having all the resources set up already (essay prompts, resume outline, university research outline) is really helpful for someone starting the application process.<br><br>PA pushed me to perfect the essays. Going in, I knew creating the perfect essay was never going to be easy. Mine took 9 drafts, and many other students needed many more drafts to complete it. Even after my school counselor gave me the pass, my mentors still found ways to help me improve. While this was difficult and stressful at the time, it shows that PA counselors genuinely care and wish to bring the abosolute best out of everyone."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/John.jfif"
  },
  {
    "id":9,
    "title" : "Journey at PA: Admissions Consulting",
    "name": "Katherine",
    "school": "Parsons",
    "info": [
      "Before starting PA, I had tried two different places for college advising. Both of those resources didn't have half as much as what PA had to offer with their spreadsheets. They also lacked the emotional support/human connection that PA advisors definitely have. Without you guys, I would have been 1000000x more stressed than I was, which is unimaginable because I was already pretty stressed. You guys were very supportive and confident in my abilities which helped me believe in myself more. The whole team were always so kind and helpful. I never hesitated if I needed to ask them for help.<br><br>I so appreciate the spreadsheets/organizational documents. They were very useful in keeping me on track and having a place I can go back and reference if needed. Through this process, I was also learning how to write. Sounds kind of silly, but you guys didn't only teach me how to apply to college, but also how to write about myself in a honest but also interesting way. My counselor has a background in creative writing and I was applying to art/design school, so he gets where I'm coming from and was thus very helpful with my artist statements/blurbs for art pieces. I honestly don't think I would have been alive right now if it wasn't for him. He helped keep me on track and provided quick and honest feedback on my essays. Being a creative himself, he also really understood where I was coming from with my artwork and artist statements. They also showed me what a good portfolio looks like, which helped me immensely when assembling mine."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/stock-artist.jpg"
  },
  {
    "id":10,
    "title" : "Journey at PA: Admissions Consulting",
    "name": "Viet D.",
    "school": "Kenyon College",
    "info": [
      "Life lesson: Whenever you think that was the hardest you have tried, it's time to try again. I made it!<br />There is something so warm about Point Avenue. There are little booths that you can study in, write essays. Even when the doors are closed, people would come by and swing it open, just to check in and chit chat :) On people's birthdays, no matter how swarmed we are with essays, we always make time to prepare a little gift, and a surprise party for the birthday-person. We would use that excuse to procrastinate the essay writing process, which really frustrated the mentors but nothing they can do about it now hehe<br />They taught me so many things. Oftentimes, a session was supposed to be focused on essay reviewing, but instead my mentor told me about how he learned to write, how to criticize your own work, and how resilient you must be. That was so much better. If it was just application essays review then I can write application essays, but in learning how to actually write, I can write anything.<br />Because of experiences like this, even when I failed my first year, I never saw it as a failure. There are too many factors to an applications that no one can control. But all the things I learned about writing, about not giving up, about bench pressing, about running a half marathon, and all the relationships I have built here--It is more than enough.<br />But now that I've gotten accepted, it's even better :D<br />To the whole PA family: this one's for you."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Viet D..jfif"
  },
  {
    "id":11,
    "title" : "Journey at PA: Admissions Consulting",
    "name": "Tien T.",
    "school": "UC Berkeley",
    "info": [
      "I started working with Point Avenue to prepare for my college application at the beginning of grade 11. Before coming to PA, I had actually visited a few consultancies, but I didn't really feel like I was heard. They told me to read books I had no interest in, and apply to schools more for the prestige than substance. After one meeting with PA, where all my interests and goals were laid out and considered, I knew this was the place for me.<br/>During my two years with PA, I was pushed in every aspect possible, from academics, testing, to interests and extracurricular activites. Despite the constant push, I always felt comfortable, because all my mentors were really like brothers and sisters. They were willing to listen to my complains and crazy business ideas, and respond to my text messages at 11pm. During stressful times, I think you need someone who is ready and willing to go through the endless pile of tasks and problems with you. New students should expect to learn unexpected things about themselves and be pushed out of your comfort zone to work hard for your goals."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Tien T.jfif"
  },
  {
    "id":12,
    "title" : "Journey at PA: Admissions Consulting",
    "name": "Eli",
    "school": "Emory",
    "info": [
      "Choosing to work with Point Avenue was a pleasure and I was so lucky to have my mentors helping me throughout the application season. I was fascinated by their efforts and efficiency on getting jobs done perfectly. Video Chat that occurs three to four times a week with my counselor helped me brainstorm the essays and getting the right mindset for applying for colleges. We collaborated well and I really enjoyed this experience.<br />Lastly, I would like to offer my sincere gratitude to my counselors and everybody else at Point Avenue who helped me during the application season for helping me getting into my dream school. Thank you! I would definitely recommend Point Avenue to my friends who want to apply to college in the US in future."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/stock-hiphop.jpg"
  },
  {
    "id":13,
    "title" : "Journey at PA: Admissions Consulting",
    "name": "An",
    "school": "Princeton",
    "info": [
      " I want to say thank you to my Point Avenue mentors for their amazing help! They’ve been so supportive during every aspect of my college application. I came to them with a jumbled collection of stories and left with polished essays that fully illustrated my key qualities. With their help, I was able to organize my thoughts, develop my narrative capabilities, and improve my overall writing.<br />Despite starting my essays extremely late, they still gave me relevant books to read and evaluate along the way, enhancing my understanding of truly impactful writing. They taught me to start out by compiling my full story (even if it was way over the word limit!). Then, through many drafts, I learned how to edit my writing down to a concise essay that still portrayed the full essence of the original story. I can say without a doubt that my writing has progressed throughout the whole process!<br />On top of meticulously analyzing countless drafts, my mentors prepared me for alumni interviews. Through many practice interviews, they gave me advice on how to answer questions eloquently, taught me the basics of “Charming 101”, and helped me build up the needed confidence for a successful interview. After all the hard work, I will be attending Princeton University this fall. In the end, I left Point Avenue with refined writing, speaking, and analytical skills that will come in handy in the future!!"
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/an.jfif"
  },
  {
    "id":14,
    "title" : "Journey at PA: Test Prep, Admissions Consulting",
    "name": "Pine",
    "school": "Pomona",
    "info": [
      "Joining Point Avenue was one of the best decisions I’ve ever made. The process of college application had been so overwhelming for myself alone, but with Point Avenue, I felt reassured and confident in every step I made. Throughout the college application process, they helped me with brainstorming ideas, shedding light to perspectives of my story that I’ve never thought of before. I feel like I’m putting my best foot forward in submitting my application.<br />The process also helped me gain perspective on my own identity. With so many questions raised throughout writing all those essays, I had to examine myself so deeply that I now know myself better. All my strengths and weaknesses, and essentially, what makes me unique as a person. Point Avenue helped me realize my own self, and, to me, that is a priceless asset that I will always appreciate throughout life.<br />I want to thank Point Avenue for guiding me through the application, and especially for always listening and reassuring me. I would highly recommend Point Avenue for any student who is considering studying in the US. They’re definitely the best team you can ever ask for."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Pine.jpg"
  },
  {
    "id":15,
    "title" : "Journey at PA: Summer Camp, Test Prep, Admissions Consulting",
    "name": "Jenny Tran",
    "school": "The Webb Schools",
    "info": [
      "My journey with Point Avenue started in 2018, when I was \"tricked\" by my mom to join a military bootcamp. I met Mr. Danny, Mr. Tommy and Mr. Tin for the first time there, not knowing they would become lifetime mentors, who are always ready to give me advice and encouragement. After camp, I remembered watching then-seniors fighting back their fatigue to study Mr. Danny's list of SSAT vocab words, and write their 50th essay. \"Lucky I'm not one of them,\" I thought to myself.<br/>This time last year, I started thinking about where I would be in the future. US? UK? High school? College? My brain was tangled and couldn't decided. Thankfully, Mr. Tommy met with my family and me and gave us guidance and I started the application process in the summer. I want to thank Mr. Francoa and Mr. Charles for teaching me IELTS and SSAT, and giving me so much work to do on Sundays, when most people spend time with their families. Chi Giang helped me with every essay, every interview practice, and even bought me bananas and dumplings to fuel our essay-writing sessions. Months flew by and it was already time to submit my applications. Chi Anh Thu was there watching me submitting every little thing. I have such vivid memories researching every single school with her, it was crazy to think the application process was almost over. Then on March 10, we videochatted and screamed when I received the acceptance letter to Webb.<br/>I cannot believe how fast the years have flown by. I'm so thankful for my PA family!"
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Jenny.jpg"
  },
  {
    "id":16,
    "title" : "Journey at PA: Admissions Consulting",
    "name": "Prae",
    "school": "Parsons, University of the Arts London",
    "info": [
      "Even though when I approached PA I didn’t have much time before my application deadlines, the mentors still managed to help complete my application. I am grateful for their guidance in my university writings and for making sure I was on top of my schedule. The team I worked with was incredibly organized and friendly which made the process went by smoothly."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/prae.jfif"
  },
  {
    "id":17,
    "title" : "Journey at PA: Test Prep, Admissions Consulting",
    "name": "Hoseong",
    "school": "King's College London",
    "info": [
      "From the moment my family sat down with my main AC for the first time, my father hoped PA would help us obtain an affordable and quality education and peace of mind through the financial aid application process. To this end, PA tracked and followed up major deadlines for submitting documents, as well as introducing me to amazing scholarship opportunities. Thanks to the huge boost from PA, I’ve been fortunate to have all the US unis meet my family’s financial needs.<br />As an applicant for both US and UK schools, I sought guidance from PA’s team with expertise in both countries’ systems. For US unis, PA helped me express myself in essays through intense summer writing seminars and in my ECA profile that demonstrated a clear interest in economics, as opposed to my previous approach of just taking on whichever opportunities that became available. PA’s test prep team worked in unison with AC to help me build an overall competitive application.<br />Writing the personal statement for UK unis required that I display intellectual curiosity by exploring specific topics in economics from wider reading. After recognising my struggle to write deeply about economics, PA connected me with an older student who had been admitted to Cambridge. I had discussions at length with them about news, articles, and books that made their way onto my statement. They helped me grow out of pass-the-next-test mentality and be more comfortable in interviews. Moreover, that this mentor is a uni student who once needed PA’s help. This fact spoke volumes to me on PA’s continued interest in students even after they left the nest and how much the students have grown from position of receiving help to giving one through PA.<br />As I finish highschool and get ready for uni, I think I can say the same for my relationship with PA. Though I began taking AC service to boost my chances to a good uni in return, I can say now with certainty that my PA experience was more than just transactional. My past years with PA have been transformational--from a clueless student to driven learner, coming-of-age movie protagonist with even greater challenges ahead--and I would not have it spent any other way."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Hoseong.jpg"
  }
  
]