[
  {
    "id": 50,
    "title" : "Journey at Point Avenue: Admissions Consulting",
    "name": "Zach",
    "school": "Columbia University",
    "info": [
      "My journey with Point Avenue started years before my application process. Under the mentorship of Danny, Tommy, and many more of PA’s warm staff, I interned at the summer camps for three years. Through the roles of teaching assistant, platoon leader, and test prep student, I watched the company flourish into a tight-knit community with a goal that went beyond rigorous academics. As a mentor, I watched my own students grow into confident young adults. Point Avenue strongly believed in a holistic teaching approach, emphasizing the importance of character building and physical fitness–all integral aspects of living a fruitful life. <br><br>When I began my application process, I was ecstatic to begin my essays with the help of the Point Avenue team. This excitement soon dwindled as I found myself wrestling with personal statement ideas, falling into a cyclical process of trying to write the perfect essay. I still remember sitting inside a hotel room on a Zoom Call with my mentors on my 18th birthday feeling overwhelmed by the sheer amount of work. Despite my lack of direction, they were more than willing to go over countless drafts to get the essay to where I wanted. <br><br>Point Avenue has been an integral part of not only my college applications but also my latter stages of adolescence. Each person’s journey to college is unique, and mine was particularly challenging. Through innumerable failures, setbacks, and frustrations, I was ultimately humbled but most importantly learned to “never give up” in the face of adversity. As I embark on a new chapter in my life, I will cherish these invaluable lessons from my time at Point Avenue, aspiring, just like my mentors, to lead and empower my own communities."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Zach_new.jpg"
  },
  {
    "id":13,
    "title" : "Journey at Point Avenue: Admissions Consulting",
    "name": "An",
    "school": "Princeton",
    "info": [
      " I want to say thank you to my Point Avenue mentors for their amazing help! They’ve been so supportive during every aspect of my college application. I came to them with a jumbled collection of stories and left with polished essays that fully illustrated my key qualities. With their help, I was able to organize my thoughts, develop my narrative capabilities, and improve my overall writing.<br><br>Despite starting my essays extremely late, they still gave me relevant books to read and evaluate along the way, enhancing my understanding of truly impactful writing. They taught me to start out by compiling my full story (even if it was way over the word limit!). Then, through many drafts, I learned how to edit my writing down to a concise essay that still portrayed the full essence of the original story. I can say without a doubt that my writing has progressed throughout the whole process!<br><br>On top of meticulously analyzing countless drafts, my mentors prepared me for alumni interviews. Through many practice interviews, they gave me advice on how to answer questions eloquently, taught me the basics of “Charming 101”, and helped me build up the needed confidence for a successful interview. After all the hard work, I will be attending Princeton University this fall. In the end, I left Point Avenue with refined writing, speaking, and analytical skills that will come in handy in the future!!"
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/an.jfif"
  },
  {
    "id": 30,
    "title" : "Journey at Point Avenue: Admissions Consulting & Test Prep",
    "name": "Vy",
    "school": "Georgetown University ",
    "info": [
      "I'd always known I wanted to study Business, but wasn't quite sure which specific aspect of business until I came to Point Avenue in grade 10. My mentors introduced a lot of materials, resources and opportunities related to business and economics so I can explore these fields from both academic and experiential angles. By grade 11, I was very sure in my decision to pursue Marketing as a major and future career path. Beyond that, I also received a lot of support and pushing when it comes to academics, and I signed up for advanced classes at school and even self-studied for 2 AP tests. When possible, my mentors spent extra time walking me through academic topics that I was struggling with.<br><br>Outside of college prep, I also studied SAT at PA. After two tries and not getting the score I wanted, I signed up for tutoring at PA and got my goal score of 1550 on my third try. <br><br>I'm extremely appreciative of all the guidance and support I received from my PA mentors. They always listened to my concerns and gave me honest feedback so I can improve. I can feel the care and attention from everyone on the team when it comes to my mental and emotional health, which helped me feel not too stressed out even during the most intense periods. Reflecting on my journey with PA, I not only learned about writing skills but also working styles and valuable insights about the field of business, which will definitely come in handy during my studies at Georgetown."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Vy+Hoang.jpg"
  },
  {
    "id": 42,
    "title" : "Journey at Point Avenue: Admissions Consulting",
    "name": "Ha Phuong",
    "school": "Hamilton College",
    "info": [
      "I'm so grateful for every single aspect of my journey with PA. Truthfully, I did not have the smoothest application season. The sheer amount of items that I needed to complete was overwhelming, but PA literally helped me with every single thing, from dozens of essays, a huge list of schools, letters of recommendation, financial aid, business competition and my theatre portfolio--they were there for it all. I have immense appreciation for how much they care, not just about my application but me as an individual.<br><br>Thank you so much for staying by my side through such a lengthy and tiring process! I definitely couldn't have got this incredible result without your help. I will certainly miss this experience working with you guys a lot lot lot."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Ha+Phuong.jpg"
  },
  {
    "id": 51,
    "title" : "Journey at Point Avenue: Admissions Consulting",
    "name": "Jinmoo",
    "school": "Rice University",
    "info": [
      "When working with PA, it really didn't feel like a straightforward guidance/tutoring service but rather true mentorship, because your mentors got to know you wholeheartedly. For example, when working with Michael, because he knew so much about who I am as a person, we were able to collaborate on app strategies and essays like Bonnie and Clyde. PA also introduced me to super useful tools like how to use bookmarks on Google Docs, and the Application Tracker--definitely a handy tracker for all my info. If there's one thing I could change about the process is listening to mentors more."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Jinmoo_new.jpg"
  },
  {
    "id": 31,
    "title" : "Journey at Point Avenue: Admissions Consulting & Test Prep",
    "name": "Kiet",
    "school": "UC Berkeley",
    "info": [
      "I started studying at Point Avenue in grade 10 in both the Test Prep and Admissions Consulting programs. Through two SAT courses, I was able to finish the SAT in grade 11 with a 1490. I also completed the TOEFL within the same year. By finishing standardized testing before grade 12, I was able to eliminate a lot of stress and truly focused on my college application. <br><br>From the very beginning, my AC mentors gave me a personalized roadmap. Under their guidance, I explored fields in journalism, media, international relations and finally decided on political science as a major. In the two years of working with PA, I've written and published interviews, op-eds, assisted on documentaries, met industry experts and successfully led a sports-focused social project that supported 17 secondary schools in Hanoi in building basketball courts. <br><br>I want to express my sincere gratitude to the mentors at PA who have always been ready and willing to support me at every turn these past few years. Thanks to PA, I've grown so much in my academics, personal characteristics and gained many life skills for college and life beyond. Thank you, PA!"
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Kiet.jpg"
  },
  {
    "id": 40,
    "title" : "Journey at Point Avenue: Summer Camp, Test Prep & Admissions Consulting",
    "name": "Viet Dung",
    "school": "Johns Hopkins",
    "info": [
      "Point Avenue mentors taught me so much about prioritization and managing my workload. When application season came, I felt prepared and knew exactly what I needed to do next, so I didn't feel overwhelmed by the large workload. It was a great journey, staying up past 11pm, past midnights and past much sorrow for weeks on. I definitely have many regrets, but everything is left behind now since we have reached our goal, and I DEFINITELY could not have done it without the help of everybody at PA, thank you once again!<br><br>Thank you to all of my AC and test prep mentors at PA, for putting up with all of my shenanigans for 3 years and staying with me until the end during the application. Your kind words and encouragement helped me got through everything. <br><br>GO BLUE JAYS!!!"
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Viet+Dung.jpg"
  },
  {
    "id": 32,
    "title" : "Journey at PA: Admissions Consulting & Test Prep",
    "name": "Duc Thanh",
    "school": "Carnegie Mellon University",
    "info": [
      "From Thanh's father: <br><br> During the application preparation process, Point Avenue mentors and teachers were very helpful and influnenced Thanh's academic and testing results, extracurricular activities, and most importantly, his personal habits and lifestyle in the most positive way possible. These changes would form the foundation for many years to come. In the end, we achieved all our goals, especially Thanh's plan to improve his personal lifestyle and discipline. Thanh has had an exciting and successful experience with Point Avenue.<br><br>Our family would like to extend our most sincere gratitude to all the teachers and mentors at Point Avenue. We wish you good health, happiness, and ever more success in your mission to support students and families on their education journeys."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Duc+Thanh.jpg"
  },
  {
    "id": 41,
    "title" : "Journey at Point Avenue: Admissions Consulting",
    "name": "Minh Anh",
    "school": "Bryn Mawr College",
    "info": [
      "Before I came to PA, I was quite disappointed in myself because I had applied to colleges on my own the year prior and did not get the results I wanted. I had a lot of self-doubt, especially being surrounded by so many talented peers. My success this year was only possible because of PA, and I cannot express how much I appreciate all my mentors. Not only did my mentors went through every step of the application with me, from refining my essays to preparing me for interviews, they also introduced me to so many cool opportunities and experts. Applying to colleges is so stressful and emotionally draining, but I also learned a lot about myself and the life I want to have."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/MA-crop.jpg"
  },
  {
    "id": 52,
    "title" : "Journey at Point Avenue: Test Prep & Admissions Consulting",
    "name": "Hoai Anh",
    "school": "Bennington College",
    "info": [
      "From Hoai Anh's mother:<br><br> First of all, I would like to thank you Tommy, Michael, all consultants and staff at Point Avenue, who have given Hoai Anh tremendous support in her application process.<br><br>Before knowing about Point Avenue, I was skeptical about all consultancies; and even up until the point I agreed to let HAL work with PA, there were still concerns wandering around my mind. But I soon realized that my daughter was truly fortunate. Michael is not only an incredible consultant, but also is a very understanding and dedicated mentor towards his students. Throughout the time HAL worked under his guidance, HAL has become a better version of herself--both in academics and personality. Thanks to this growth, she is very confident about her college journey in America.<br><br>One of the things I am most impressed about Point Avenue is the professionalism, from the teachers, mentors, consultants to the admin teams. They work with all their hearts, pay attention to every detail, and are always willing to find the most effective solutions whenever issues arise. Even now, sometimes I wonder 'What if we didn't find out about Point Avenue?!' (It is truly relieving to know that it's only 'what if'<br><br>Once again, thank you everyone. I wish the PA family tremendous success."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Hoai_Anh_new.png"
  },
  {
    "id":11,
    "title" : "Journey at Point Avenue: Admissions Consulting",
    "name": "Tien T.",
    "school": "UC Berkeley, Haas School of Business",
    "info": [
      "I started working with Point Avenue to prepare for my college application at the beginning of grade 11. Before coming to PA, I had actually visited a few consultancies, but I didn't really feel like I was heard. They told me to read books I had no interest in, and apply to schools more for the prestige than substance. After one meeting with PA, where all my interests and goals were laid out and considered, I knew this was the place for me.<br><br>During my two years with PA, I was pushed in every aspect possible, from academics, testing, to interests and extracurricular activites. Despite the constant push, I always felt comfortable, because all my mentors were really like brothers and sisters. They were willing to listen to my complains and crazy business ideas, and respond to my text messages at 11pm. During stressful times, I think you need someone who is ready and willing to go through the endless pile of tasks and problems with you. New students should expect to learn unexpected things about themselves and be pushed out of your comfort zone to work hard for your goals."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Tien T.jfif"
  },
  {
    "id":53,
    "title" : "Journey at Point Avenue: Admissions Consulting",
    "name": "Lexi",
    "school": "Vanderbilt University",
    "info": [
      "Thank you all so, so much. I really could not have done it without your help and encouragement. The whole process was stressful, exhausting, and an insane amount of work, but it was totally worth it. Once again, thank you!!"
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Lexi.jpg"
  },
  {
    "id":54,
    "title" : "Journey at Point Avenue: Admissions Consulting",
    "name": "Lam D",
    "school": "Villanova University, Presidential Scholar",
    "info": [
      "From Lam's mother: <br><br>We are extremely thrilled to receive news from Villanova University, announcing that Lam has been selected as a full-ride Presidential Scholarship recipient and will join the school's Honors Program. To have the chance to study abroad in the United States with this prestigious scholarship is not only Lam's, but our family's, dream. Furthermore, we understand that achieving this one of a kind opportunity resulted from not only our son's perseverance and determination, but also Point Avenue team's dedication and efforts. <br><br>When we came to PA, there wasn't much time before the ED application deadline. We still remember how much Lam struggled with brainstorming ideas for his personal statement, as well as finding ways to highlight his abilities and demonstrate his interests in the application. Despite the rushed timeline, we were confident Lam had made the right decision in choosing to work with PA. <br><br>Once again, our family would like to send our deepest gratitude to Point Avenue team. We sincerely hope you will continue your success in education consulting!"
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Lam_D.jpg"
  },
  {
    "id": 18,
    "title" : "Journey at Point Avenue: Admissions Consulting",
    "name": "Huy Anh",
    "school": "University of Virginia",
    "info": [
      "My journey of getting into a U.S. college was wild and full of ups and downs. During the application process, I was overwhelmed by the volume and magnitude of the choices I had to make. Fortunately, the process was much less ambiguous and confusing through Point Avenue’s assistance. Everything, from forming my school list, coming up with my personal statement, to the nitty-gritty of filling out forms, was made easier with their professional help. <br><br>The process also made me realize important things about my aspirations and goals. I started out wanting to major in business, but their mentoring process helped me acknowledge and examine my needs much more clearly, pushing me towards a liberating liberal arts education I never knew I needed. <br><br>Most importantly, Point Avenue stuck with me till the end. It didn’t matter if I had a stroke of inspiration and wanted to rewrite my entire essay a few hours before the deadline, or if I wanted to restart with a new application season when the old results didn’t satisfy me, Point Avenue never denied me their assistance. I could not have asked for anyone better."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Huy+anh.jpg"
  },
  {
    "id": 19,
    "title" : "Journey at Point Avenue: Summer Camp, Test Prep & Admissions Consulting",
    "name": "Tung Pham",
    "school": "Boston University",
    "info": [
      "Thank you all of my AC mentors at PA, for helping me on my application process and helping me reach the goal that I never thought I deserved. What I love about people of PA is that they help me learn to manage my time and work more efficiently, and never hesitate to give me advice about anything and everything. It's been nearly 2 years working with everyone, and I've truly grown to be much more independent and responsible, though that's never enough. Just want to say thank you and I've always been proud to be a part of PA."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Tung+Pha.jpg"
  },
  {
    "id": 1,
    "title" : "Journey at Point Avenue: Admissions Consulting",
    "name": "Nhi D.",
    "school": "Pomona College",
    "info": [
      "I will never forget the moment I broke into tears in front of John two or three days before my ED deadline because my PS wasn't going anywhere and I felt like I couldn't take it anymore. So embarrassing!! And then John was like oh it's OK just let it out. I really felt like having a big brother at that moment. Thank you, I hadn't expected for my vulnerability to be received that way. I think PA mentors are so much more than coaches that I diligently listen and look up to. Everyone I've met at PA before and during the application season was incredibly kind, thoughtful and encouraging. You're like my extended family. You've helped me tons in becoming more confident in tackling the innumerable challenges both in college application and in life."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/NhiD.jpg"
  },
  {
    "id": 2,
    "title" : "Journey at Point Avenue: Admissions Consulting",
    "name": "Thu Yen",
    "school": "Bryn Mawr College",
    "info": [
      "I don’t know how else I could start writing this other than by crying, because that’s how we started this journey. In the small co-working office, I was scared of a gloomy future that required an overwhelming level of preparation. But I came back because I was assured that PA was different and that the mentors had faith in me. I could spend days talking about PA.<br><br>Anytime I come to the office, I always feel welcomed. They are always there for me even when I can do things by myself, simply to cheer me up and help me believe in myself more. No matter how busy my mentors are, they are always smiling or working out in the gym, serving as a great source of motivation and encouragement. They make it so easy for me to venture into new territory with the courage to fail, because I know they'll always be there to pick me up and guide me through those failures. From watching the teachers and mentors interact with students and parents, I have learned how they instill “Character First” in education: by embracing it themselves. PA is where I have learned to embrace differences and respect my own choices. Most people just see the tip of the iceberg. I was urged by PA mentors to look at matters from different perspectives, and I think I really have become a more accepting person, to other people and to myself."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/ThuYen.jpg"
  },
  {
    "id": 3,
    "title" : "Journey at Point Avenue: Admissions Consulting",
    "name": "Eileen",
    "school": "UCLA",
    "info": [
      "Initially, I was brainstorming and writing all my essays alone for my Early Decision application. The greatest challenge I faced was identifying whether my essay was showcasing myself well enough. Although I had several people read my essays, I was constantly conflicted as I received different opinions from people who did not know the US application process very well, so the process was getting time-consuming and frustrating.<br><br> Point Avenue was an integral part of my college application process. When I planned ideas alone, I dwelled on ideas wondering if this was a good topic to write about or not. Point Avenue gave me answers on what ideas worked and didn’t right away, and gave constructive advice on how to make my story as personal, concise yet entertaining as possible. As a result, I was able to write essays that encapsulated myself well and I am not only satisfied with my college results, but the essays as well. Without Point Avenue, I would have not been able to successfully wrap up my college application journey.<br><br>"
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Eileen.jpg"
  },
  {
    "id": 4,
    "title" : "Journey at Point Avenue: Test Preparation, Admissions Consulting",
    "name": "Duc Minh",
    "school": "Union College",
    "info": [
      "All PA mentors are super supportive. Everything I asked, no matter how silly that could be, you guys always answer wholeheartedly. Throughout this application process, I have made so many mistakes, but I always got your full support. This has really been my motivation to work harder and pay more attention to what I was doing. They introduced me to a new way to organize my work and time: planner. Overall, my work ethics improved a lot after PA because everyone here is extremely efficient and taught me a lot about time management. I also notice that I pay much more attention to details in every piece of work I produce because I saw how it could help me stand out among other undergraduate candidates and to not stop polishing my work until I am completely satisfied.<br><br>Also, all work is ensured to be done professionally. Everyone knows how the system works, and therefore are able to provide students and parents with great advice and wise decisions. I was about to decline my ED school and kept applying in the RD market at the last minute. I was fortunate enough to receive professional advice and stopped, or else I could have ended up at another school that didn't fit me and cost more.<br><br>One of the most valuable things to me is the emotional support I received at PA. The counselors pushed me to confront my own values. They saw the good side of me before I even realized it in myself."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/DucMinh.jpg"
  },
  {
    "id": 5,
    "title" : "Journey at Point Avenue: Admissions Consulting",
    "name": "My Le",
    "school": "NYU, Tisch School of the Arts",
    "info": [
      "When I decided to apply to universities in the United States, I wasn’t planning on seeking help from any outside sources because I was unable to find a counseling agency that suited me and my needs. Then I got the chance to attend one of PA’s workshops about personal statement writing, and at that time my personal statement was not good at all. The teachers were very patient with my writing and guided me toward a final piece that truly represented me. Countless questions were raised to provoke my mind and to allow me to define my identity. The mentors did so much more than just revising our essay or aiding us with the application, they truly helped us to reach further, dream bigger, and better ourselves each and everyday. Looking back, I believe that going to PA’s workshop about crafting personal statements and later on, joining the Point Avenue family was one of the best decisions my senior year."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/MyLe.jpg"
  },
  {
    "id": 6,
    "title" : "Journey at PA: Admissions Consulting",
    "name": "Steven",
    "school": "NYU, Stern School of Business",
    "info": [
      "Initially, it was hard for me to believe someone could ever save my applications. There was only one and a half months left for me to apply to all of my 20+ colleges around the world, and I had underestimated the insane amount of work and research needed to finish the applications. It felt like mission impossible, but my mentor really made it happen with his patience, work ethic, and well-managed time schedule.<br><br>Finally, I was accepted into my Early Decision school, as well as most of the schools I applied to during the Early Round. My mentor was not only a good writing coach, but also an amazing listener. I was astonished by how all his advice and guidance, based on my many essay drafts, were able to connect all my ideas, life events, thoughts, and beliefs and weave them into one narrative so fluidly. It brought order and clarity to what felt like pure chaos.<br><br>Admittedly, I also developed a clearer understanding of myself throughout my time working with him. My growth and his trait of being a good listener, made a real and significant change to my whole application as he helped me figure out how to showcase my best authentic self. Working with him really made me feel all my efforts led to a perfect and positive result. I hope there will be future opportunities to work with PA again because they not only helped me complete everything with the highest quality possible, but also learn about myself throughout the process. I would recommend PA to anyone."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Steven.jpg"
  },
  {
    "id": 7,
    "title" : "Journey at PA: Admissions Consulting",
    "name": "XK",
    "school": "Princeton",
    "info": [
      "Before I came to Point Avenue, I had only one draft written 10 days before the submission deadline and absolutely no idea what I was doing. It was only thanks to Jason’s and Tommy’s encyclopaedic understanding of the US admissions system and indefatigable support and guidance that I was able to complete my applications at all, let alone obtain an offer from the school of my dreams. They were not only staggeringly competent, but also dedicated, understanding, and a genuine pleasure to work with.<br><br>In late December, I was struggling to balance my college applications with a full-day training camp I had to attend. Tommy and Jason were willing to work around my hair-tearingly frustrating schedule. They understood my predicament, stayed up late well past midnight to help me with my essays, and moved forward even when training meant I was vanishing for hours at a time. They did not make any effort to “teach” me or force me to write as someone I was not, but rather listened patiently to what ideas I had and guided my thinking to tease out the best possible version of myself. Tommy and Jason are two of the most dedicated, competent, and passionate educators I’ve had the honour of learning from, and I would definitely encourage anyone else in need of help to seek guidance from them as well."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Debate Stock.jpg"
  },
  {
    "id":8,
    "title" : "Journey at Point Avenue: Test Prep, Admissions Consulting",
    "name": "John",
    "school": "UC Berkeley",
    "info": [
      "PAAC comes across as really friendly, and they offer help as friends and mentors, not teachers. Not only do they have the know-hows of college admissions, they genuinely cared. My consultant was always patient even when my essay writing was on halt for quite a while, and understood my situation. Also having all the resources set up already (essay prompts, resume outline, university research outline) is really helpful for someone starting the application process.<br><br>PA pushed me to perfect the essays. Going in, I knew creating the perfect essay was never going to be easy. Mine took 9 drafts, and many other students needed many more drafts to complete it. Even after my school counselor gave me the pass, my mentors still found ways to help me improve. While this was difficult and stressful at the time, it shows that PA counselors genuinely care and wish to bring the abosolute best out of everyone."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/John.jfif"
  },
  {
    "id":9,
    "title" : "Journey at Point Avenue: Admissions Consulting",
    "name": "Katherine",
    "school": "Parsons",
    "info": [
      "Before starting PA, I had tried two different places for college advising. Both of those resources didn't have half as much as what PA had to offer with their spreadsheets. They also lacked the emotional support/human connection that PA advisors definitely have. Without you guys, I would have been 1000000x more stressed than I was, which is unimaginable because I was already pretty stressed. You guys were very supportive and confident in my abilities which helped me believe in myself more. The whole team were always so kind and helpful. I never hesitated if I needed to ask them for help.<br><br>I so appreciate the spreadsheets/organizational documents. They were very useful in keeping me on track and having a place I can go back and reference if needed. Through this process, I was also learning how to write. Sounds kind of silly, but you guys didn't only teach me how to apply to college, but also how to write about myself in a honest but also interesting way. My counselor has a background in creative writing and I was applying to art/design school, so he gets where I'm coming from and was thus very helpful with my artist statements/blurbs for art pieces. I honestly don't think I would have been alive right now if it wasn't for him. He helped keep me on track and provided quick and honest feedback on my essays. Being a creative himself, he also really understood where I was coming from with my artwork and artist statements. They also showed me what a good portfolio looks like, which helped me immensely when assembling mine."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/stock-artist.jpg"
  },
  {
    "id":10,
    "title" : "Journey at Point Avenue: Admissions Consulting",
    "name": "Viet D.",
    "school": "Kenyon College",
    "info": [
      "Life lesson: Whenever you think that was the hardest you have tried, it's time to try again. I made it!<br><br>There is something so warm about Point Avenue. There are little booths that you can study in, write essays. Even when the doors are closed, people would come by and swing it open, just to check in and chit chat :) On people's birthdays, no matter how swarmed we are with essays, we always make time to prepare a little gift, and a surprise party for the birthday-person. We would use that excuse to procrastinate the essay writing process, which really frustrated the mentors but nothing they can do about it now hehe<br><br>They taught me so many things. Oftentimes, a session was supposed to be focused on essay reviewing, but instead my mentor told me about how he learned to write, how to criticize your own work, and how resilient you must be. That was so much better. If it was just application essays review then I can write application essays, but in learning how to actually write, I can write anything.<br><br>Because of experiences like this, even when I failed my first year, I never saw it as a failure. There are too many factors to an applications that no one can control. But all the things I learned about writing, about not giving up, about bench pressing, about running a half marathon, and all the relationships I have built here--It is more than enough.<br><br>But now that I've gotten accepted, it's even better :D<br><br>To the whole PA family: this one's for you."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Viet D..jfif"
  },
  
  {
    "id":12,
    "title" : "Journey at Point Avenue: Admissions Consulting",
    "name": "Eli",
    "school": "Emory",
    "info": [
      "Choosing to work with Point Avenue was a pleasure and I was so lucky to have my mentors helping me throughout the application season. I was fascinated by their efforts and efficiency on getting jobs done perfectly. Video Chat that occurs three to four times a week with my counselor helped me brainstorm the essays and getting the right mindset for applying for colleges. We collaborated well and I really enjoyed this experience.<br><br>Lastly, I would like to offer my sincere gratitude to my counselors and everybody else at Point Avenue who helped me during the application season for helping me getting into my dream school. Thank you! I would definitely recommend Point Avenue to my friends who want to apply to college in the US in future."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/stock-hiphop.jpg"
  },
  
  {
    "id":14,
    "title" : "Journey at Point Avenue: Test Prep, Admissions Consulting",
    "name": "Pine",
    "school": "Pomona",
    "info": [
      "Joining Point Avenue was one of the best decisions I’ve ever made. The process of college application had been so overwhelming for myself alone, but with Point Avenue, I felt reassured and confident in every step I made. Throughout the college application process, they helped me with brainstorming ideas, shedding light to perspectives of my story that I’ve never thought of before. I feel like I’m putting my best foot forward in submitting my application.<br><br>The process also helped me gain perspective on my own identity. With so many questions raised throughout writing all those essays, I had to examine myself so deeply that I now know myself better. All my strengths and weaknesses, and essentially, what makes me unique as a person. Point Avenue helped me realize my own self, and, to me, that is a priceless asset that I will always appreciate throughout life.<br><br>I want to thank Point Avenue for guiding me through the application, and especially for always listening and reassuring me. I would highly recommend Point Avenue for any student who is considering studying in the US. They’re definitely the best team you can ever ask for."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Pine.jpg"
  },
  {
    "id":15,
    "title" : "Journey at Point Avenue: Summer Camp, Test Prep, Admissions Consulting",
    "name": "Jenny Tran",
    "school": "The Webb Schools",
    "info": [
      "My journey with Point Avenue started in 2018, when I was \"tricked\" by my mom to join a military bootcamp. I met Mr. Danny, Mr. Tommy and Mr. Tin for the first time there, not knowing they would become lifetime mentors, who are always ready to give me advice and encouragement. After camp, I remembered watching then-seniors fighting back their fatigue to study Mr. Danny's list of SSAT vocab words, and write their 50th essay. \"Lucky I'm not one of them,\" I thought to myself.<br><br>This time last year, I started thinking about where I would be in the future. US? UK? High school? College? My brain was tangled and couldn't decided. Thankfully, Mr. Tommy met with my family and me and gave us guidance and I started the application process in the summer. I want to thank Mr. Francoa and Mr. Charles for teaching me IELTS and SSAT, and giving me so much work to do on Sundays, when most people spend time with their families. Chi Giang helped me with every essay, every interview practice, and even bought me bananas and dumplings to fuel our essay-writing sessions. Months flew by and it was already time to submit my applications. Chi Anh Thu was there watching me submitting every little thing. I have such vivid memories researching every single school with her, it was crazy to think the application process was almost over. Then on March 10, we videochatted and screamed when I received the acceptance letter to Webb.<br><br>I cannot believe how fast the years have flown by. I'm so thankful for my PA family!"
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Jenny.jpg"
  },
  {
    "id":16,
    "title" : "Journey at Point Avenue: Admissions Consulting",
    "name": "Prae",
    "school": "Parsons, University of the Arts London",
    "info": [
      "Even though when I approached PA I didn’t have much time before my application deadlines, the mentors still managed to help complete my application. I am grateful for their guidance in my university writings and for making sure I was on top of my schedule. The team I worked with was incredibly organized and friendly which made the process went by smoothly."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/prae.jfif"
  },
  {
    "id":17,
    "title" : "Journey at Point Avenue: Test Prep, Admissions Consulting",
    "name": "Hoseong",
    "school": "King's College London",
    "info": [
      "From the moment my family sat down with my main AC for the first time, my father hoped PA would help us obtain an affordable and quality education and peace of mind through the financial aid application process. To this end, PA tracked and followed up major deadlines for submitting documents, as well as introducing me to amazing scholarship opportunities. Thanks to the huge boost from PA, I’ve been fortunate to have all the US unis meet my family’s financial needs.<br><br>As an applicant for both US and UK schools, I sought guidance from PA’s team with expertise in both countries’ systems. For US unis, PA helped me express myself in essays through intense summer writing seminars and in my ECA profile that demonstrated a clear interest in economics, as opposed to my previous approach of just taking on whichever opportunities that became available. PA’s test prep team worked in unison with AC to help me build an overall competitive application.<br><br>Writing the personal statement for UK unis required that I display intellectual curiosity by exploring specific topics in economics from wider reading. After recognising my struggle to write deeply about economics, PA connected me with an older student who had been admitted to Cambridge. I had discussions at length with them about news, articles, and books that made their way onto my statement. They helped me grow out of pass-the-next-test mentality and be more comfortable in interviews. Moreover, that this mentor is a uni student who once needed PA’s help. This fact spoke volumes to me on PA’s continued interest in students even after they left the nest and how much the students have grown from position of receiving help to giving one through PA.<br><br>As I finish highschool and get ready for uni, I think I can say the same for my relationship with PA. Though I began taking AC service to boost my chances to a good uni in return, I can say now with certainty that my PA experience was more than just transactional. My past years with PA have been transformational--from a clueless student to driven learner, coming-of-age movie protagonist with even greater challenges ahead--and I would not have it spent any other way."
    ],
    "img": "https://pointavenue.sgp1.cdn.digitaloceanspaces.com/pasite/images/sub/admission-consulting/studies/Hoseong.jpg"
  }
  
]